Revit 2027 API
ParameterTypeId.WallCrossSection Property
 "Cross-Section"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId WallCrossSection { get; }
Public Shared ReadOnly Property WallCrossSection As ForgeTypeId
	Get
public:
static property ForgeTypeId^ WallCrossSection {
	ForgeTypeId^ get ();
}
static member WallCrossSection : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace